<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"35383c008abf0385de784f955837277c516be64b1c9e15fc0a3de1e312f66859","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1283 at https://github.com/cal-itp/data-infra/actions/runs/20735815308","plan_out_hash":"9e82e752fcab55f993d4b5d85fdd2f980d77d7584761af8fd02131fc24b3eac4","plan_hash":"efa010146e7072b44834f20685f77e8bb563247d8551cdd3bcf0d6562a361ffe","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "EYV24w==" -> (known after apply)
!~      detect_md5hash      = "hrGWSQnQHlZQ99/ZjeykQg==" -> "different hash"
!~      generation          = 1767658067099789 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "hrGWSQnQHlZQ99/ZjeykQg==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "vy+BMQ==" -> (known after apply)
!~      detect_md5hash      = "7P7md/03Vx+HPGs6YsXLFQ==" -> "different hash"
!~      generation          = 1767660911148847 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "7P7md/03Vx+HPGs6YsXLFQ==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/intermediate/transit_database/dimensions/.DS_Store"] will be destroyed
  # (because key ["models/intermediate/transit_database/dimensions/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1767658067096925 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fintermediate%2Ftransit_database%2Fdimensions%2F.DS_Store?generation=1767658067096925&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       output_name         = "data/warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fintermediate%2Ftransit_database%2Fdimensions%2F.DS_Store" -> null
-       source              = "../../../../warehouse/models/intermediate/transit_database/dimensions/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/.DS_Store"] will be destroyed
  # (because key ["models/mart/gtfs/.DS_Store"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "application/octet-stream" -> null
-       crc32c              = "sYtuGQ==" -> null
-       detect_md5hash      = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       event_based_hold    = false -> null
-       generation          = 1767658067095849 -> null
-       id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/.DS_Store" -> null
-       md5hash             = "GUV3p+IL3Mevu3GPUCwTTA==" -> null
-       md5hexhash          = "194577a7e20bdcc7afbb718f502c134c" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2F.DS_Store?generation=1767658067095849&alt=media" -> null
-       metadata            = {} -> null
-       name                = "data/warehouse/models/mart/gtfs/.DS_Store" -> null
-       output_name         = "data/warehouse/models/mart/gtfs/.DS_Store" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/data%2Fwarehouse%2Fmodels%2Fmart%2Fgtfs%2F.DS_Store" -> null
-       source              = "../../../../warehouse/models/mart/gtfs/.DS_Store" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1283](https://github.com/cal-itp/data-infra/actions/runs/20735815308)